#### Pandas Basic Assignment
-------------------------------

#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

1. A Pandas Series is like a column in a table.

2. It is a one-dimensional array holding data of any type.

In [1]:
import pandas as pd # module related to pandas

In [2]:
data = pd.Series([4, 8, 15, 16, 23, 42])  ## the numbers/data has to be passed in a list to pd.Series function.
print(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
type(data)
## its Series type

pandas.core.series.Series

--------------------

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it

In [4]:
list1 = [10,2,3,4,50,60,7,80,9,100]  # list having 10 elements 

series_list = pd.Series(list1)  ## pandas.Series function to convert the list to Series

In [5]:
print(series_list)

0     10
1      2
2      3
3      4
4     50
5     60
6      7
7     80
8      9
9    100
dtype: int64

In [6]:
type(series_list)  ## its a Series type

pandas.core.series.Series


-----------------------

#### Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

|Name|Age|Gender|
|---|---|---|
|Alice|25|Female|
|Bob|30|Male|
|Claire|27|Female|

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [8]:
## Constructing DataFrame from a dictionary.

data3 = {
'Name' : ['Alice','Bob','Claire'],
'Age' : [25,30,27],
'Claire' : ['Female','Male','Female']
}

In [9]:
Q3_df = pd.DataFrame(data3)

Q3_df

     Name  Age  Claire
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

-----------------

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

*DataFrame*

1. A pandas DataFrame is a two-dimensional data structure that can be thought of as a spreadsheet. 

2. A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

3. It can also be thought of as a collection of two or more series with common indices.

In [10]:
# Example of dictionary conversion to dataFrame.
data_q4 = {
'Name' : ['Virat Kohli','Arun Kumar J','Sachin Tendulkar','Cristiano Ronaldo','Smriti Mandanna'],
'Age' : [34,32,50,37,27],
'Sex' : ['Male','Male','Male','Male','Female']
}

## converting the dictionary to DataFrame

df_q4 = pd.DataFrame(data_q4)

## checking the type of the variable - df_q4
type(df_q4)

pandas.core.frame.DataFrame

In [11]:
df_q4
## We can see that the below is the df_q4 which is a table like structure.

                Name  Age     Sex
0        Virat Kohli   34    Male
1       Arun Kumar J   32    Male
2   Sachin Tendulkar   50    Male
3  Cristiano Ronaldo   37    Male
4    Smriti Mandanna   27  Female

In [12]:
## creating a dataframe from an .csv file

In [13]:
df_csv = pd.read_csv('services.csv')
df_csv.head(2) # used to view the first 2 elements in a dataframe.

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN

In [14]:
type(df_csv) # its of type DataFrame

pandas.core.frame.DataFrame

*Series*

1. A Pandas Series is like a column in a table.

2. A Python one-dimensional labelled array called a Pandas Series may hold any form of data (integer, float, string, etc.). 

3. It is possible to create new Series by using lists, arrays, dictionaries, and existing Series objects. 

4. Also each column of a DataFrame is a Series, we can say collection of series together is a Dataframe

In [16]:
## Creating a series by selecting a single dataframe column called Name
Name_series = df_q4['Name']  
Name_series

0          Virat Kohli
1         Arun Kumar J
2     Sachin Tendulkar
3    Cristiano Ronaldo
4      Smriti Mandanna
Name: Name, dtype: object

In [17]:
type(Name_series)

pandas.core.series.Series

In [19]:
## Creating a Series from the list
Age_series = pd.Series([10,22,44,33,22,23,112,33])
Age_series

0     10
1     22
2     44
3     33
4     22
5     23
6    112
7     33
dtype: int64

In [20]:
type(Age_series)

pandas.core.series.Series

---------------

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [34]:
## lets take an example, by importing a .csv file.

df_q5 = pd.read_csv('services.csv')

In [35]:
## list down the top 2 rows in the dataFrame
df_q5.head(2)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN

In [36]:
## list down the last 2 rows in the dataFrame
df_q5.tail(2)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
21,22,22,NaN,"Cash, Check, Credit Card",Fotos para pasaportes,Walk in or apply by phone or mail,"Profit and nonprofit businesses, the public, m...",[NOTE THIS IS NOT A REAL SERVICE--THIS IS FOR ...,None,passports@example.org,...,We offer 3-way interpretation services over th...,"Salud, Medicina",Spanish,Passport Photos,Government-issued picture identification,"Alameda County, San Mateo County",active,No wait to 2 weeks.,http://www.example.com,"105, 108, 108-05, 108-05-01, 111, 111-05"
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [37]:
## describe() - This function provides a summary of the statistical distribution of the data in a DataFrame.

df_q5.describe()


## it gives the statistical distribution of the Numerical columns of the dataframe.
## like count --> count of each records for that particular column
## mean/min/max --> mean/min/max of each records for that particular column
## 25th,50th and 75th Percentile as well

             id  location_id  program_id
count  23.00000    23.000000         0.0
mean   12.00000    11.956522         NaN
std     6.78233     6.711444         NaN
min     1.00000     1.000000         NaN
25%     6.50000     6.500000         NaN
50%    12.00000    12.000000         NaN
75%    17.50000    17.500000         NaN
max    23.00000    22.000000         NaN

In [38]:
df_q5.columns ## to know the columns present in the dataframe

Index(['id', 'location_id', 'program_id', 'accepted_payments',
       'alternate_name', 'application_process', 'audience', 'description',
       'eligibility', 'email', 'fees', 'funding_sources',
       'interpretation_services', 'keywords', 'languages', 'name',
       'required_documents', 'service_areas', 'status', 'wait_time', 'website',
       'taxonomy_ids'],
      dtype='object')

In [39]:
df_q5.dtypes ## to know the datatypes of the column in the dataframe

id                           int64
location_id                  int64
program_id                 float64
accepted_payments           object
alternate_name              object
application_process         object
audience                    object
description                 object
eligibility                 object
email                       object
fees                        object
funding_sources             object
interpretation_services     object
keywords                    object
languages                   object
name                        object
required_documents          object
service_areas               object
status                      object
wait_time                   object
website                     object
taxonomy_ids                object
dtype: object

In [40]:
df_q5[df_q5.dtypes[df_q5.dtypes == int].index].head(2) ## to check only the int column

   id  location_id
0   1            1
1   2            2

In [41]:
pd.Categorical(df_q5['status'])
## give the categories/unique details in the column - Status

['active', 'active', 'active', 'active', 'active', ..., 'active', 'defunct', 'inactive', 'active', 'active']
Length: 23
Categories (3, object): ['active', 'defunct', 'inactive']

In [42]:
df_q5['fees'].unique

# used to get the unique values from the column.

<bound method Series.unique of 0     $2.50 suggested donation for lunch for age 60 ...
1     None. Donations requested of clients who can a...
2                                                 None.
3     Vary according to income ($5-$90). Cash, check...
4         $60 application fee. Cash or checks accepted.
5     $55 per year membership dues. Classes have fee...
6     $85 per day. Vary according to income for thos...
7     Suggested donation of $4.25 per meal for senio...
8                                                 None.
9                                                 None.
10                                                None.
11                                                None.
12                                                None.
13                                                None.
14                                                None.
15    None for emergency services. Vary for after sc...
16                                                None.
17                                                None.
18                                                None.
19                                                  NaN
20                                                  NaN
21    None, except for permits and photocopying. Cas...
22    None, except for permits and photocopying. Cas...
Name: fees, dtype: object>

In [43]:
df_q5=df_q5.drop('fees',axis=1) ## to delete/drop the column from the dataframe

In [49]:
df_q5['fees'] ## when we tried to check for the 'fees' column, we got an Key Error.
## as the key column has been dropped by previous command

KeyError: 'fees'

In [52]:
df_q4

# lets try to calculate the mean age of the dataframe

                Name  Age     Sex
0        Virat Kohli   34    Male
1       Arun Kumar J   32    Male
2   Sachin Tendulkar   50    Male
3  Cristiano Ronaldo   37    Male
4    Smriti Mandanna   27  Female

In [54]:
df_q4['Age'].mean()  ## mathematical function used to check mean/average age of the group.

36.0

---------------------

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

|Data Structure	| Mutability |
|---|---|
|Series	| Mutable|
|DataFrame |	Mutable |
|Panel | 	Not Mutable |

*SERIES*

In [59]:
# sample list data_6_s

data_6_s = [10,2]

## creating a series from a list

s1 = pd.Series(data_6_s)
s1 ## now s1 series has data 10,2

0    10
1     2
dtype: int64

In [61]:
## Let's try to replace the 0th Element of the Series with my Name.

## i.e 10 needs to be replaced by 'Arun Kumar j'

s1[0] = 'Arun Kumar J'
s1

# we can clearly see that the Series data has been mutatated.

0    Arun Kumar J
1               2
dtype: object

*DATAFRAME*

In [62]:
data_6 = {
'Name' : ["Arun","Virat","Sachin"],
'Age' : [32,34,50]
}
data_6

## Dictonary data_6

{'Name': ['Arun', 'Virat', 'Sachin'], 'Age': [32, 34, 50]}

In [63]:
## creating a dataframe from dictinary 

df_q6 = pd.DataFrame(data_6)
df_q6

     Name  Age
0    Arun   32
1   Virat   34
2  Sachin   50

In [64]:
## Now lets try to add a new column called Team to the dataframe
df_q6['Team'] = ['RCB','RCB','MI']
df_q6

# so we can see that we are able to add a new column called Team with the values of our choices to the Dataframe.

     Name  Age Team
0    Arun   32  RCB
1   Virat   34  RCB
2  Sachin   50   MI

In [65]:
df_q6['Team'] = ['INDIA','INDIA','INDIA']
df_q6
## now we tried to change the team names to "INDIA', and we were successfully able to chnage the data.

## Hence DATAFRAMES are mutable objects - Value mutatable and size mutable as well. 
## cause initially we were able to create dataframe with 2 columns, and then added a new column called Team.
## then we were also able to change the value of the column Team as well.

## DataFrames are mutable.

     Name  Age   Team
0    Arun   32  INDIA
1   Virat   34  INDIA
2  Sachin   50  INDIA

*PANEL*

1. Panel is a three-dimensional labeled array that can hold any data type. 
2. It is not mutable, meaning that the values in a Panel cannot be changed after it has been created.

---------------------

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [66]:
series_2_name = pd.Series(['Arun','Virat','Sudhanshu','KrishNaik','Deepika','Angelina','Katrina','Sachin','ABD','XYZ'])
series_3_age = pd.Series([32,34,32,33,34,45,34,50,33])
series_4_married = pd.Series(['no','yes','yes','yes','yes','yes','yes','yes','yes'])

# We have above 3 individual series --> name , age and married
# lets try to bring this all 3 series into a single table like structure - DataFrame

In [67]:
df_q7 = pd.DataFrame([series_2_name,series_3_age,series_4_married],index=['Name','Age','Married?'])
df_q7

## we are passing the 3 series as an input in the form of list
## and we are explicitly giving the row index

## also to note that, the length of the series_2_name - 10, series - series_3_age & series_4_married  - 9.
## so for the values thats not present, it will automatically assign Nan value. 
## a missing value is denoted by NaN

,0,1,2,3,4,5,6,7,8,9
Name,Arun,Virat,Sudhanshu,KrishNaik,Deepika,Angelina,Katrina,Sachin,ABD,XYZ
Age,32.0,34.0,32.0,33.0,34.0,45.0,34.0,50.0,33.0,NaN
Married?,no,yes,yes,yes,yes,yes,yes,yes,yes,NaN

In [68]:
type(df_q7)

pandas.core.frame.DataFrame

In [70]:
df_q7.T

## .T --> transpose() - a function used to change the data 180 degress. i.e from vertical view to horizontal view.

        Name   Age Married?
0       Arun  32.0       no
1      Virat  34.0      yes
2  Sudhanshu  32.0      yes
3  KrishNaik  33.0      yes
4    Deepika  34.0      yes
5   Angelina  45.0      yes
6    Katrina  34.0      yes
7     Sachin  50.0      yes
8        ABD  33.0      yes
9        XYZ   NaN      NaN

--------------------